# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'youtube-dl'

# Development
brew 'node'
brew 'nvm'
brew 'yarn'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'dropbox'
cask 'discord'
cask 'google-chrome'
cask 'gpg-suite'
cask 'microsoft-excel'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'portfolioperformance'
cask 'postman'
cask 'sizeup'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'HotspotShield', id: 771076721
