# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'oven-sh/bun'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'flyctl'
brew 'gh'
brew 'git'
brew 'mackup'
# brew 'mas' # Mac App Store manager
brew 'yt-dlp'

# Development
brew 'bun'
brew 'deno'
brew 'node'
brew 'nvm'
brew 'pnpm'
brew 'yarn'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'intellij-idea'
cask 'microsoft-excel'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'mixed-in-key'
cask 'portfolioperformance'
cask 'postman'
cask 'rekordbox'
cask 'sizeup'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'vlc'
cask 'webstorm'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
# mas 'HotspotShield', id: 771076721
